import { RegionData } from "@/types";

export const regions: RegionData[] = [
  {
    name: "천안시",
    alias: ["천안"],
    subRegions: [
      {
        name: "동남구",
        alias: ["천안 동남구", "천안시 동남구"],
        subRegions: [
          { name: "목천읍", alias: ["목천읍", "천안 목천읍"] },
          { name: "풍세면", alias: ["풍세면", "천안 풍세면"] },
          { name: "광덕면", alias: ["광덕면", "천안 광덕면"] },
          { name: "북면", alias: ["북면", "천안 북면"] },
          { name: "성남면", alias: ["성남면", "천안 성남면"] },
          { name: "수신면", alias: ["수신면", "천안 수신면"] },
          { name: "병천면", alias: ["병천면", "천안 병천면"] },
          { name: "동면", alias: ["동면", "천안 동면"] },
          { name: "중앙동", alias: ["중앙동", "천안 중앙동"] },
          { name: "문성동", alias: ["문성동", "천안 문성동"] },
          { name: "원성동", alias: ["원성동", "천안 원성동"] },
          { name: "봉명동", alias: ["봉명동", "천안 봉명동"] },
          { name: "일봉동", alias: ["일봉동", "천안 일봉동"] },
          { name: "신방동", alias: ["신방동", "천안 신방동"] },
          { name: "청룡동", alias: ["청룡동", "천안 청룡동"] },
          { name: "신안동", alias: ["신안동", "천안 신안동"] }
        ]
      },
      {
        name: "서북구",
        alias: ["천안 서북구", "천안시 서북구"],
        subRegions: [
          { name: "성환읍", alias: ["성환읍", "천안 성환읍"] },
          { name: "성거읍", alias: ["성거읍", "천안 성거읍"] },
          { name: "직산읍", alias: ["직산읍", "천안 직산읍"] },
          { name: "입장면", alias: ["입장면", "천안 입장면"] },
          { name: "성정동", alias: ["성정동", "천안 성정동", "서북구 성정동", "천안시 서북구 성정동"] },
          { name: "쌍용동", alias: ["쌍용동", "천안 쌍용동"] },
          { name: "백석동", alias: ["백석동", "천안 백석동"] },
          { name: "불당동", alias: ["불당동", "천안 불당동"] },
          { name: "부성동", alias: ["부성동", "천안 부성동"] }
        ]
      }
    ]
  },
  {
    name: "아산시",
    alias: ["아산"],
    subRegions: [
      { name: "염치읍", alias: ["염치읍", "아산 염치읍"] },
      { name: "배방읍", alias: ["배방읍", "아산 배방읍", "아산시 배방읍"] },
      { name: "송악면", alias: ["송악면", "아산 송악면"] },
      { name: "탕정면", alias: ["탕정면", "아산 탕정면"] },
      { name: "음봉면", alias: ["음봉면", "아산 음봉면"] },
      { name: "둔포면", alias: ["둔포면", "아산 둔포면"] },
      { name: "영인면", alias: ["영인면", "아산 영인면"] },
      { name: "인주면", alias: ["인주면", "아산 인주면"] },
      { name: "선장면", alias: ["선장면", "아산 선장면"] },
      { name: "도고면", alias: ["도고면", "아산 도고면"] },
      { name: "신창면", alias: ["신창면", "아산 신창면"] },
      { name: "온양동", alias: ["온양동", "아산 온양동", "온양1동", "온양2동", "온양3동", "온양4동", "온양5동", "온양6동"] }
    ]
  },
  {
    name: "태안군",
    alias: ["태안"],
    subRegions: [
      { name: "태안읍", alias: ["태안읍", "태안 태안읍"] },
      { name: "안면읍", alias: ["안면읍", "태안 안면읍", "태안군 안면읍"] },
      { name: "고남면", alias: ["고남면", "태안 고남면"] },
      { name: "남면", alias: ["남면", "태안 남면"] },
      { name: "근흥면", alias: ["근흥면", "태안 근흥면"] },
      { name: "소원면", alias: ["소원면", "태안 소원면"] },
      { name: "원북면", alias: ["원북면", "태안 원북면"] },
      { name: "이원면", alias: ["이원면", "태안 이원면"] }
    ]
  },
  {
    name: "당진시",
    alias: ["당진"],
    subRegions: [
      { name: "합덕읍", alias: ["합덕읍", "당진 합덕읍"] },
      { name: "송악읍", alias: ["송악읍", "당진 송악읍", "당진시 송악읍"] },
      { name: "고대면", alias: ["고대면", "당진 고대면"] },
      { name: "석문면", alias: ["석문면", "당진 석문면"] },
      { name: "대호지면", alias: ["대호지면", "당진 대호지면"] },
      { name: "정미면", alias: ["정미면", "당진 정미면"] },
      { name: "면천면", alias: ["면천면", "당진 면천면"] },
      { name: "순성면", alias: ["순성면", "당진 순성면"] },
      { name: "우강면", alias: ["우강면", "당진 우강면"] },
      { name: "신평면", alias: ["신평면", "당진 신평면"] },
      { name: "송산면", alias: ["송산면", "당진 송산면"] },
      { name: "당진동", alias: ["당진동", "당진1동", "당진2동", "당진3동"] }
    ]
  },
  {
    name: "서산시",
    alias: ["서산"],
    subRegions: [
      { name: "대산읍", alias: ["대산읍", "서산 대산읍"] },
      { name: "인지면", alias: ["인지면", "서산 인지면"] },
      { name: "부석면", alias: ["부석면", "서산 부석면"] },
      { name: "팔봉면", alias: ["팔봉면", "서산 팔봉면"] },
      { name: "지곡면", alias: ["지곡면", "서산 지곡면"] },
      { name: "성연면", alias: ["성연면", "서산 성연면"] },
      { name: "음암면", alias: ["음암면", "서산 음암면"] },
      { name: "운산면", alias: ["운산면", "서산 운산면"] },
      { name: "해미면", alias: ["해미면", "서산 해미면"] },
      { name: "고북면", alias: ["고북면", "서산 고북면"] },
      { name: "부춘동", alias: ["부춘동", "서산 부춘동"] },
      { name: "동문동", alias: ["동문동", "서산 동문동", "동문1동", "동문2동"] },
      { name: "활성동", alias: ["활성동", "서산 활성동"] },
      { name: "석남동", alias: ["석남동", "서산 석남동"] }
    ]
  },
  {
    name: "공주시",
    alias: ["공주"],
    subRegions: [
      { name: "유구읍", alias: ["유구읍", "공주 유구읍"] },
      { name: "이인면", alias: ["이인면", "공주 이인면"] },
      { name: "탄천면", alias: ["탄천면", "공주 탄천면"] },
      { name: "계룡면", alias: ["계룡면", "공주 계룡면"] },
      { name: "반포면", alias: ["반포면", "공주 반포면"] },
      { name: "의당면", alias: ["의당면", "공주 의당면"] },
      { name: "사곡면", alias: ["사곡면", "공주 사곡면"] },
      { name: "신풍면", alias: ["신풍면", "공주 신풍면"] },
      { name: "우성면", alias: ["우성면", "공주 우성면"] },
      { name: "중학동", alias: ["중학동", "공주 중앙동"] },
      { name: "웅진동", alias: ["웅진동", "공주 웅진동"] },
      { name: "금학동", alias: ["금학동", "공주 금학동"] },
      { name: "옥룡동", alias: ["옥룡동", "공주 옥룡동"] },
      { name: "신관동", alias: ["신관동", "공주 신관동"] },
      { name: "월송동", alias: ["월송동", "공주 월송동"] }
    ]
  },
  {
    name: "보령시",
    alias: ["보령"],
    subRegions: [
      { name: "웅천읍", alias: ["웅천읍", "보령 웅천읍"] },
      { name: "주포면", alias: ["주포면", "보령 주포면"] },
      { name: "주교면", alias: ["주교면", "보령 주교면"] },
      { name: "오천면", alias: ["오천면", "보령 오천면"] },
      { name: "천북면", alias: ["천북면", "보령 천북면"] },
      { name: "청소면", alias: ["청소면", "보령 청소면"] },
      { name: "청라면", alias: ["청라면", "보령 청라면"] },
      { name: "남포면", alias: ["남포면", "보령 남포면"] },
      { name: "주산면", alias: ["주산면", "보령 주산면"] },
      { name: "미산면", alias: ["미산면", "보령 미산면"] },
      { name: "성주면", alias: ["성주면", "보령 성주면"] },
      { name: "대천동", alias: ["대천동", "보령 대천동", "대천1동", "대천2동", "대천3동", "대천4동", "대천5동"] }
    ]
  },
  {
    name: "논산시",
    alias: ["논산"],
    subRegions: [
      { name: "강경읍", alias: ["강경읍", "논산 강경읍"] },
      { name: "연무읍", alias: ["연무읍", "논산 연무읍"] },
      { name: "성동면", alias: ["성동면", "논산 성동면"] },
      { name: "광석면", alias: ["광석면", "논산 광석면"] },
      { name: "노성면", alias: ["노성면", "논산 노성면"] },
      { name: "상월면", alias: ["상월면", "논산 상월면"] },
      { name: "부적면", alias: ["부적면", "논산 부적면"] },
      { name: "연산면", alias: ["연산면", "논산 연산면"] },
      { name: "벌곡면", alias: ["벌곡면", "논산 벌곡면"] },
      { name: "양촌면", alias: ["양촌면", "논산 양촌면"] },
      { name: "가야곡면", alias: ["가야곡면", "논산 가야곡면"] },
      { name: "은진면", alias: ["은진면", "논산 은진면"] },
      { name: "채운면", alias: ["채운면", "논산 채운면"] },
      { name: "취암동", alias: ["취암동", "논산 취암동"] },
      { name: "부창동", alias: ["부창동", "논산 부창동"] }
    ]
  },
  {
    name: "계룡시",
    alias: ["계룡"],
    subRegions: [
      { name: "두마면", alias: ["두마면", "계룡 두마면"] },
      { name: "엄사면", alias: ["엄사면", "계룡 엄사면"] },
      { name: "신도안면", alias: ["신도안면", "계룡 신도안면"] },
      { name: "금암동", alias: ["금암동", "계룡 금암동"] }
    ]
  },
  {
    name: "금산군",
    alias: ["금산"],
    subRegions: [
      { name: "금산읍", alias: ["금산읍", "금산군 금산읍"] },
      { name: "제원면", alias: ["제원면", "금산군 제원면"] },
      { name: "부리면", alias: ["부리면", "금산군 부리면"] },
      { name: "군북면", alias: ["군북면", "금산군 군북면"] },
      { name: "남일면", alias: ["남일면", "금산군 남일면"] },
      { name: "남이면", alias: ["남이면", "금산군 남이면"] },
      { name: "진산면", alias: ["진산면", "금산군 진산면"] },
      { name: "복수면", alias: ["복수면", "금산군 복수면"] },
      { name: "추부면", alias: ["추부면", "금산군 추부면"] }
    ]
  },
  {
    name: "부여군",
    alias: ["부여"],
    subRegions: [
      { name: "부여읍", alias: ["부여읍", "부여군 부여읍"] },
      { name: "규암면", alias: ["규암면", "부여군 규암면"] },
      { name: "은산면", alias: ["은산면", "부여군 은산면"] },
      { name: "외산면", alias: ["외산면", "부여군 외산면"] },
      { name: "내산면", alias: ["내산면", "부여군 내산면"] },
      { name: "구룡면", alias: ["구룡면", "부여군 구룡면"] },
      { name: "홍산면", alias: ["홍산면", "부여군 홍산면"] },
      { name: "옥산면", alias: ["옥산면", "부여군 옥산면"] },
      { name: "남면", alias: ["남면", "부여군 남면"] },
      { name: "충화면", alias: ["충화면", "부여군 충화면"] },
      { name: "양화면", alias: ["양화면", "부여군 양화면"] },
      { name: "임천면", alias: ["임천면", "부여군 임천면"] },
      { name: "장암면", alias: ["장암면", "부여군 장암면"] },
      { name: "세도면", alias: ["세도면", "부여군 세도면"] },
      { name: "석성면", alias: ["석성면", "부여군 석성면"] },
      { name: "초촌면", alias: ["초촌면", "부여군 초촌면"] }
    ]
  },
  {
    name: "서천군",
    alias: ["서천"],
    subRegions: [
      { name: "장항읍", alias: ["장항읍", "서천 장항읍"] },
      { name: "서천읍", alias: ["서천읍", "서천 서천읍"] },
      { name: "마서면", alias: ["마서면", "서천 마서면"] },
      { name: "화양면", alias: ["화양면", "서천 화양면"] },
      { name: "기산면", alias: ["기산면", "서천 기산면"] },
      { name: "한산면", alias: ["한산면", "서천 한산면"] },
      { name: "마산면", alias: ["마산면", "서천 마산면"] },
      { name: "시초면", alias: ["시초면", "서천 시초면"] },
      { name: "문산면", alias: ["문산면", "서천 문산면"] },
      { name: "판교면", alias: ["판교면", "서천 판교면"] },
      { name: "종천면", alias: ["종천면", "서천 종천면"] },
      { name: "비인면", alias: ["비인면", "서천 비인면"] },
      { name: "서면", alias: ["서면", "서천 서면"] }
    ]
  },
  {
    name: "청양군",
    alias: ["청양"],
    subRegions: [
      { name: "청양읍", alias: ["청양읍", "청양 청양읍"] },
      { name: "운곡면", alias: ["운곡면", "청양 운곡면"] },
      { name: "대치면", alias: ["대치면", "청양 대치면"] },
      { name: "정산면", alias: ["정산면", "청양 정산면"] },
      { name: "목면", alias: ["목면", "청양 목면"] },
      { name: "청남면", alias: ["청남면", "청양 청남면"] },
      { name: "장평면", alias: ["장평면", "청양 장평면"] },
      { name: "남양면", alias: ["남양면", "청양 남양면"] },
      { name: "화성면", alias: ["화성면", "청양 화성면"] },
      { name: "비봉면", alias: ["비봉면", "청양 비봉면"] }
    ]
  },
  {
    name: "홍성군",
    alias: ["홍성"],
    subRegions: [
      { name: "홍성읍", alias: ["홍성읍", "홍성 홍성읍"] },
      { name: "광천읍", alias: ["광천읍", "홍성 광천읍"] },
      { name: "홍북읍", alias: ["홍북읍", "홍성 홍북읍"] },
      { name: "금마면", alias: ["금마면", "홍성 금마면"] },
      { name: "홍동면", alias: ["홍동면", "홍성 홍동면"] },
      { name: "장곡면", alias: ["장곡면", "홍성 장곡면"] },
      { name: "은하면", alias: ["은하면", "홍성 은하면"] },
      { name: "결성면", alias: ["결성면", "홍성 결성면"] },
      { name: "서부면", alias: ["서부면", "홍성 서부면"] },
      { name: "갈산면", alias: ["갈산면", "홍성 갈산면"] },
      { name: "구항면", alias: ["구항면", "홍성 구항면"] }
    ]
  },
  {
    name: "예산군",
    alias: ["예산"],
    subRegions: [
      { name: "예산읍", alias: ["예산읍", "예산 예산읍"] },
      { name: "삽교읍", alias: ["삽교읍", "예산 삽교읍"] },
      { name: "대술면", alias: ["대술면", "예산 대술면"] },
      { name: "신양면", alias: ["신양면", "예산 신양면"] },
      { name: "광시면", alias: ["광시면", "예산 광시면"] },
      { name: "대흥면", alias: ["대흥면", "예산 대흥면"] },
      { name: "응봉면", alias: ["응봉면", "예산 응봉면"] },
      { name: "덕산면", alias: ["덕산면", "예산 덕산면"] },
      { name: "봉산면", alias: ["봉산면", "예산 봉산면"] },
      { name: "고덕면", alias: ["고덕면", "예산 고덕면"] },
      { name: "신암면", alias: ["신암면", "예산 신암면"] },
      { name: "오가면", alias: ["오가면", "예산 오가면"] }
    ]
  }
];
